# Tính tiền điện dành cho hộ gia đình
a=eval(input("Nhập số Kwh tiêu thụ : "))
# Bậc 1:
if 0<=a<=50:
    t=a*1.678
# Bậc 2:
elif 50<a<=100:
    t=50*1.678+(a-50)*1.734
# Bậc 3:
elif 100<a<=200:
    t=50*1.678+50*1.734+(a-100)*2.014
# Bậc 4:
elif 200<a<=300:
    t=50*1.678+50*1.734+100*2.014+(a-200)*2.536
# Bậc 5:
elif 300<a<=400:
    t=50*1.678+50*1.734+100*2.014+100*2.536+(a-300)*2.834
# Bậc 6:
else:
    t=50*1.678+50*1.734+100*2.014+100*2.536+100*2.834+(a-400)*2.927
print ( " Số tiền phải trả là: ", t ,"đồng")


